--- a/work-2-02/分析 Zookeeper 设置数据操作(SetData) 的处理流程.md
+++ b/work-2-02/分析 Zookeeper 设置数据操作(SetData) 的处理流程.md
@@ -41,19 +41,16 @@ if (r.getErr() != 0) {
 return response.getStat();
 ```
 
-```plantuml
-@startuml
-skinparam responseMessageBelowArrow true
-skinparam sequenceMessageAlign left
-autonumber 
+```mermaid
+sequenceDiagram
 
-Zookeeper -> Zookeeper: new RequestHeader(); \nnew SetDataRequest(); \nnew SetDataResponse();
-Zookeeper -> ClientCnxn: cnxn.submitRequest(header, request, response, null)
-ClientCnxn -> ClientCnxn: queuePacket();
-ClientCnxn -> ClientCnxn: waitForPacketFinish();
-ClientCnxn --> Zookeeper: syncWait
-Zookeeper -> Zookeeper: response.getStat();
-@enduml
+Zookeeper ->> Zookeeper: new RequestHeader()<br/> new SetDataRequest()<br/> new SetDataResponse();
+Zookeeper ->> ClientCnxn: cnxn.submitRequest(header, request, response, null)
+ClientCnxn ->> ClientCnxn: queuePacket();
+ClientCnxn ->> ClientCnxn: waitForPacketFinish();
+ClientCnxn -->> Zookeeper: syncWait
+Zookeeper ->> Zookeeper: response.getStat();
+
 ```
 
 异步发送  `org.apache.zookeeper.ZooKeeper#setData(java.lang.String, byte[], int, org.apache.zookeeper.AsyncCallback.StatCallback, java.lang.Object)`  
@@ -62,17 +59,13 @@ Zookeeper -> Zookeeper: response.getStat();
 cnxn.queuePacket(h, new ReplyHeader(), request, response, cb, clientPath, serverPath, ctx, null);
 ```
 
-```plantuml
-@startuml
-skinparam responseMessageBelowArrow true
-skinparam sequenceMessageAlign left
-autonumber 
+```mermaid
+sequenceDiagram
 
-Zookeeper -> Zookeeper: new RequestHeader(); \nnew SetDataRequest(); \nnew SetDataResponse();
-Zookeeper -> ClientCnxn: cnxn.queuePacket(header, request, response, callback, ctx)
+Zookeeper ->> Zookeeper: new RequestHeader()<br/> new SetDataRequest() new SetDataResponse();
+Zookeeper ->> ClientCnxn: cnxn.queuePacket(header, request, response, callback, ctx)
+ClientCnxn ->> ClientCnxn: queuePacket(); 
 
-ClientCnxn -> ClientCnxn: queuePacket(); #red
-@enduml
 ```
 
 ### `queuePacket()` Packet入队
@@ -137,31 +131,30 @@ Do transportation work:
 
 `org.apache.zookeeper.ClientCnxnSocketNetty#doTransport`
 
-```plantuml
-@startuml
-SendThread -> ClientCnxnSocketNetty:  clientCnxnSocket.doTransport()
-ClientCnxnSocketNetty -> OutgoingQueue: poll() 
-OutgoingQueue --> ClientCnxnSocketNetty: Packet
-ClientCnxnSocketNetty -> ClientCnxnSocketNetty: doWrite(Packet)
-ClientCnxnSocketNetty -> PendingQueue: add(Packet)
-ClientCnxnSocketNetty -> ClientCnxnSocketNetty: sendPktOnly(Packet)
-Packet -> Packet :p.createBB()
+```mermaid
+sequenceDiagram
+SendThread ->> ClientCnxnSocketNetty:  clientCnxnSocket.doTransport()
+ClientCnxnSocketNetty ->> OutgoingQueue: poll() 
+OutgoingQueue -->> ClientCnxnSocketNetty: Packet
+ClientCnxnSocketNetty ->> ClientCnxnSocketNetty: doWrite(Packet)
+ClientCnxnSocketNetty ->> PendingQueue: add(Packet)
+ClientCnxnSocketNetty ->> ClientCnxnSocketNetty: sendPktOnly(Packet)
+Packet ->> Packet :p.createBB()
 
-@enduml
 ```
 
 `org.apache.zookeeper.ClientCnxnSocketNIO#doTransport`
 
-```plantuml
-@startuml
-SendThread -> ClientCnxnSocketNIO:  clientCnxnSocket.doTransport()
-ClientCnxnSocketNIO -> ClientCnxnSocketNIO: doIo() 
-ClientCnxnSocketNIO --> OutgoingQueue: findSendablePacket()
-OutgoingQueue --> ClientCnxnSocketNIO: Packet
-Packet -> Packet :p.createBB()
-ClientCnxnSocketNIO -> ClientCnxnSocketNIO: write()
-ClientCnxnSocketNIO -> PendingQueue: add(Packet)
-@enduml
+```mermaid
+sequenceDiagram
+SendThread ->> ClientCnxnSocketNIO:  clientCnxnSocket.doTransport()
+ClientCnxnSocketNIO ->> ClientCnxnSocketNIO: doIo() 
+ClientCnxnSocketNIO ->> OutgoingQueue: findSendablePacket()
+OutgoingQueue -->> ClientCnxnSocketNIO: Packet
+Packet ->> Packet :p.createBB()
+ClientCnxnSocketNIO ->> ClientCnxnSocketNIO: write()
+ClientCnxnSocketNIO ->> PendingQueue: add(Packet)
+
 ```
 
 ## Server 端处理请求
